app/controllers/authors_controller.rb

  def index
    unless logged_in?
      redirect_to new_login_url
      return
    end
    @authors = Author.all
---
SELECT * FROM "authors"

  def show
    unless logged_in?
      redirect_to new_login_url
      return
    end
    @author = Author.find(params[:id])
---
SELECT * FROM "authors" WHERE ("authors"."id" = 1)

  def edit
    unless logged_in?
      redirect_to new_login_url
      return
    end
    @author = Author.find(params[:id])
---
SELECT * FROM "authors" WHERE ("authors"."id" = 980190962)

  def create
    unless logged_in?
      redirect_to new_login_url
      return
    end
    @author = Author.new(params[:author])

    respond_to do |format|
      if @author.save
---
INSERT INTO "authors" ("name", "created_at", "updated_at") VALUES('Shakespeare', '2010-01-30 06:51:21', '2010-01-30 06:51:21')

  def update
    unless logged_in?
      redirect_to new_login_url
      return
    end
    @author = Author.find(params[:id])
---
SELECT * FROM "authors" WHERE ("authors"."id" = 980190962)

  def destroy
    unless logged_in?
      redirect_to new_login_url
      return
    end
    @author = Author.find(params[:id])
    @author.destroy
---
SELECT * FROM "authors" WHERE ("authors"."id" = 980190962)
DELETE FROM "authors" WHERE "id" = 980190962