app/controllers/genders_controller.rb

  def index
    unless logged_in?
      redirect_to new_login_url
      return
    end
    @genders = Gender.all
---
SELECT * FROM "genders"

  def show
    @gender = Gender.find(params[:id])
---
SELECT * FROM "genders" WHERE ("genders"."id" = 980190962)

  def edit
    unless logged_in?
      redirect_to new_login_url
      return
    end
    @gender = Gender.find(params[:id])
---
SELECT * FROM "genders" WHERE ("genders"."id" = 980190962)

  def create
    unless logged_in?
      redirect_to new_login_url
      return
    end
    @gender = Gender.new(params[:gender])

    respond_to do |format|
      if @gender.save
---
INSERT INTO "genders" ("name", "created_at", "updated_at") VALUES(NULL, '2010-01-30 06:38:17', '2010-01-30 06:38:17')

  def update
    unless logged_in?
      redirect_to new_login_url
      return
    end
    @gender = Gender.find(params[:id])
---
SELECT * FROM "genders" WHERE ("genders"."id" = 980190962)

  def destroy
    unless logged_in?
      redirect_to new_login_url
      return
    end
    @gender = Gender.find(params[:id])
    @gender.destroy
---
SELECT * FROM "genders" WHERE ("genders"."id" = 980190962)
DELETE FROM "genders" WHERE "id" = 980190962