app/controllers/monologues_controller.rb

  def index
    @monologues = Monologue.all
---
SELECT * FROM "monologues"

  def edit
    @monologue = Monologue.find(params[:id])
    @plays = Play.all
    @genders = Gender.all
---
SELECT * FROM "genders"