app/controllers/monologues_controller.rb

SELECT * FROM "monologues" WHERE ("monologues"."id" = 1)
---
  def show
    @monologue = Monologue.find(params[:id])

SELECT * FROM "plays"
SELECT * FROM "genders"
---
  def new
    unless logged_in?
      redirect_to new_login_url
      return
    end
    @monologue = Monologue.new
    @plays = Play.all
    @genders = Gender.all

SELECT * FROM "monologues" WHERE ("monologues"."id" = 1)
SELECT * FROM "plays"
---
  def edit
    unless logged_in?
      redirect_to new_login_url
      return
    end
    @monologue = Monologue.find(params[:id])
    @plays = Play.all

INSERT INTO "monologues" ("section", "name", "created_at", "body", "character", "updated_at", "gender_id", "play_id", "style") VALUES('II v 1', 'M, O, A, I; this simulation is not as the former', '2010-01-30 07:51:42', 'M, O, A, I; this simulation is not as the former: and yet, to crush this a little, it would bow to me, for every one of these letters are in my name. Soft! here follows prose.
---
  def create
    unless logged_in?
      redirect_to new_login_url
      return
    end
    @monologue = Monologue.new(params[:monologue])
    if @monologue.save

SELECT * FROM "monologues" WHERE ("monologues"."id" = 1)
UPDATE "monologues" SET "updated_at" = '2010-01-30 07:18:31', "character" = 'Orsino', "style" = 'Verse' WHERE "id" = 1
---
  def update
    unless logged_in?
      redirect_to new_login_url
      return
    end
    @monologue = Monologue.find(params[:id])
    if @monologue.update_attributes(params[:monologue])

SELECT * FROM "monologues" WHERE ("monologues"."id" = 3)
DELETE FROM "monologues" WHERE "id" = 3
---
  def destroy
    unless logged_in?
      redirect_to new_login_url
      return
    end
    @monologue = Monologue.find(params[:id])
    @monologue.destroy

SELECT * FROM "monologues" WHERE (name like 'myssssddss')
SELECT * FROM "plays" WHERE ("plays"."id" = 1)
SELECT * FROM "monologues"
---
  def search
    @ajax_search = params[:search]
    @play_id = params[:p]
    @gender_id = params[:g]
    @both_gender_id = GENDER[ 'Both' ]

    if @ajax_search.blank?

      # no search terms
      if @play_id and @gender_id
        @monologues = Monologue.find(
          :all,
          :conditions =>
            ['(gender_id = ? OR gender_id = ?) AND play_id = ?', @gender_id, @both_gender_id, @play_id]
        )

      elsif @play_id
        @monologues = Monologue.find_all_by_play_id(@play_id)

      elsif @gender_id
        # this branch (gender_id, but no search terms) might be unused
        @monologues = Monologue.find(
          :all,
          :limit => 20,
          :conditions =>
            ['gender_id = ? OR gender_id = ?', @gender_id, @both_gender_id]
        )
      else
        # this branch (no search terms) might be unused
        @monologues = Monologue.all(:limit => 20)