app/controllers/plays_controller.rb

SELECT * FROM "plays"
---
  def index
    @plays = Play.all

SELECT * FROM "plays" WHERE ("plays"."id" = 1)
---
  def show
    @play = Play.find(params[:id])

SELECT * FROM "plays" WHERE ("plays"."id" = 1)
---
  def edit
    unless logged_in?
      redirect_to new_login_url
      return
    end
    @play = Play.find(params[:id])

INSERT INTO "plays" ("created_at", "title", "updated_at", "author_id") VALUES('2010-01-30 06:53:00', 'Twelfth Night', '2010-01-30 06:53:00', 1)
---
  def create
    unless logged_in?
      redirect_to new_login_url
      return
    end
    @play = Play.new(params[:play])

    respond_to do |format|
      if @play.save

SELECT * FROM "plays" WHERE ("plays"."id" = 1)
---
  def update
    unless logged_in?
      redirect_to new_login_url
      return
    end
    @play = Play.find(params[:id])

SELECT * FROM "plays" WHERE ("plays"."id" = 3)
DELETE FROM "plays" WHERE "id" = 3
---
  def destroy
    unless logged_in?
      redirect_to new_login_url
      return
    end
    @play = Play.find(params[:id])
    @play.destroy